Revit 2024 API
FabricationPart.IsBoughtOut Property
 True if the fabrication part is bought out.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool IsBoughtOut { get; }
Visual Basic
Public ReadOnly Property IsBoughtOut As Boolean
	Get
Visual C++
public:
property bool IsBoughtOut {
	bool get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace